[PAD]
[UNK]
[CLS]
[SEP]
[MASK]
0
1
2
3
4
5
6
7
8
9
##1
##7
##3
##8
##9
##2
##0
##5
##4
##6
##50
37
##48
3750
##00
##99
##65
##10
##37
##93
##12
648
##46
55
##19
16
24
48
##11
60
##98
##30
900
##60
##49
##15
##03
##40
##39
##35
25
##66
##70
##69
##44
##22
##67
19
59
337
73
45
##28
##68
##61
15
##33
##659
68
38
##41
22
3370
53
30
18
62
##73
##77
50
13
42
##17
446
##122
39
##80
493
41
12
10
44
28
##72
##58
6122
##71
210
56
4464
70
54
7399
##20
##63
4939
##43
75
##59
27
58
20
##13
23
3659
##18
##90
52
40
4811
35
##64
32
669
5598
299
2465
##16
##42
66
##55
72
##47
46
2400
5560
##45
57
2109
4893
##92
33
4411
##24
##31
412
17
1699
##96
599
544
##38
1519
##52
803
1635
67
322
31
6065
36
49
##53
749
21
5998
##62
237
##407
1903
47
5445
1324
29
##06
##985
2376
560
65
##51
340
173
##32
4659
##465
##89
635
69
3800
5948
146
##036
1460
465
1633
1985
11
137
549
517
##614
6017
2614
##87
1465
3961
4853
5393
2210
6250
5602
3700
5977
2799
##95
##702
4646
619
7539
4516
2252
151
7543
6357
139
737
3915
5410
##91
610
7495
##662
913
##79
6093
##194
5620
4128
360
##289
568
##25
5780
74
5915
7194
4149
3223
2073
##57
307
1375
449
368
##26
2490
2662
5491
730
26
369
4490
##76
##54
5296
5036
##56
298
4269
350
2106
5858
5330
419
698
3686
1394
246
1667
##29
6045
470
3099
361
5176
5430
##27
43
650
61
##23
##151
2539
1866
34
##97
##154
4559
6038
4704
192
671
##778
1141
##186
1080
6248
51
##88
3272
5028
1567
665
6831
4190
##480
6104
528
##677
410
3618
##333
##14
3374
2859
7010
##09
1702
3166
2119
3530
3605
4525
6407
##81
4822
##86
750
712
1099
6644
248
5659
219
7186
3772
5510
5589
531
6637
573
1407
5619
2986
742
4480
##02
3641
##05
4063
63
1920
1722
1906
2515
##301
##74
439
5677
910
5689
5778
5736
4124
5011
4167
##78
##75
5310
1070
1767
2212
7377
5612
7509
2595
1018
1736
##21
6835
3263
512
281
3809
5537
628
1363
432
71
1277
3220
440
3893
3743
##117
4958
2555
2541
5566
6887
1871
358
690
2289
##397
2107
2265
133
4969
3300
622
2597
6040
6242
5949
4151
140
746
4409
5057
1066
486
3870
##923
1854
5096
300
4562
2313
7467
7261
7058
2828
268
##94
7492
703
5470
366
3747
7346
744
4109
##83
6508
5051
2693
2112
7044
5526
7239
##729
346
5702
3068
##82
303
6832
3661
6810
172
4392
##85
150
490
498
660
1731
7123
2364
2489
673
2380
1679
5264
3694
4211
541
##929
6734
3859
6333
6293
1734
6929
435
6630
177
6980
319
6983
4936
6759
3560
3568
2729
##304
6286
1215
1344
1815
600
4576
617
6656
7305
472
1401
103
##396
1913
4721
211
##006
5530
7444
7055
1031
##226
2770
761
5520
5284
2304
4231
363
3792
2538
3634
262
2549
571
2461
6501
1647
6641
450
6101
4630
3630
5037
2975
212
##674
2087
5271
2967
1877
7370
467
3193
2471
623
1036
4498
4230
2410
4139
715
3038
##486
4655
264
1859
645
##283
499
3706
2827
3196
2621
5640
1362
4148
3154
4301
2197
6301
3433
4293
1779
##469
1348
519
310
##84
3000
193
3586
7039
666
250
640
1279
6453
6289
3335
6609
606
3780
593
6206
2147
6770
3864
550
5718
##417
1334
1726
4068
##36
4967
5122
2466
2446
200
312
670
7255
2058
4333
290
4216
2923
1641
2717
6469
433
2674
652
6713
4261
6405
6714
4933
5282
1264
4350
955
6822
2810
5450
2456
598
572
1271
5328
3578
1816
2402
4499
199
3440
3523
3317
4462
6920
4412
##695
7309
885
6811
2786
4671
5192
6909
5681
2115
5538
7328
233
7449
7160
##338
922
1844
5724
3692
478
2791
408
134
3397
##308
265
6485
3067
3912
6654
##134
2444
5787
343
7403
94
7349
5041
4599
1241
6178
2891
7212
668
5338
893
656
3976
293
4046
64
4326
3971
868
4902
872
4180
3018
4321
6012
4181
1610
2192
1952
4089
4173
7159
535
4417
4298
2463
4233
2151
2154
5139
6227
4117
##708
6521
2685
437
4744
6352
1511
3607
2899
4407
6666
228
1605
2435
2226
2695
1582
7400
5397
4531
3585
3242
5178
4105
1580
348
1258
1219
6740
4125
2974
4923
565
2282
5864
5505
790
7256
2042
7486
4866
6966
1695
663
2522
3695
6569
658
2477
5165
4080
7154
5547
6050
4612
659
5955
4981
667
6919
4998
##01
6088
422
##354
296
6861
3504
4469
5889
740
3329
5906
5519
145
330
1571
2029
4650
116
965
383
2612
5971
4510
4430
3461
1970
6833
349
2021
4145
411
3765
3648
3203
4568
3137
510
4741
826
122
5938
6518
6846
5006
4396
1934
4355
2993
2396
5292
5498
3231
3373
522
7363
2121
2315
7408
##182
4166
3901
3508
314
430
5698
6722
1660
537
2848
6319
3106
4291
6143
111
580
4780
1457
847
6886
2448
1999
5744
1146
6689
5497
532
2205
5708
438
5099
2004
736
2506
1227
3117
5235
1323
6014
5810
2990
3764
5999
5166
7037
980
6350
3770
5788
4909
3056
5920
1116
2970
3464
920
7528
751
3342
4986
7420
6535
5816
##987
507
##07
4653
3500
3012
3945
1283
655
7465
1592
4802
3007
5926
794
##34
3824
1308
2688
273
1395
3937
6182
641
2255
2334
##706
3310
3289
1919
1706
6596
414
7047
1335
6160
7257
5226
88
4553
584
##351
810
4381
7013
1613
5988
4351
5521
##603
5105
3495
1778
4751
5370
2984
4114
6043
7354
6798
222
974
4042
4819
1043
6854
1951
591
5413
##152
827
4760
3019
5221
569
6902
7327
7006
2499
101
##436
4399
1684
5909
6768
1924
2851
6220
3366
6678
4237
4450
1245
271
611
1405
2592
764
400
6223
365
6284
3731
3255
2738
127
7251
6985
7436
5803
3051
644
672
1724
6235
1351
##395
112
1688
463
693
2968
4053
5251
2348
2007
5562
5814
4369
4315
138
1214
3477
341
2716
2331
3725
5492
548
##132
2835
4583
577
4677
3084
4603
3644
7023
220
3017
3646
1735
2570
4768
1315
6930
110
1132
7366
2378
5063
5984
144
2918
561
1899
315
3396
3481
4302
500
2528
5081
3819
6165
##962
2218
6962
7134
1152
5957
5791
7127
1629
318
983
5688
428
5179
6602
3186
1697
6751
3283
632
2983
4220
2838
6651
6163
304
1255
2769
5801
5839
5117
6973
3134
2316
6176
4040
5693
3227
6515
477
979
6977
462
7077
3377
6567
14
936
2407
1170
6725
4543
7091
3097
543
1379
3247
3364
1914
1879
734
7532
6027
7421
6308
546
6662
3128
1103
902
3956
213
4542
7042
5095
277
3987
6899
4036
6015
6695
6760
720
631
1730
4858
7373
4595
6560
393
2230
3501
5881
873
2367
3844
1889
##663
6115
316
260
6552
492
6007
6003
7490
3529
218
2722
495
##994
5389
7147
4202
2328
894
2131
812
6583
4786
2602
5854
2229
5860
5775
6314
661
3129
7019
3531
4287
6613
4454
404
4458
4779
3938
2505
1805
3654
4329
4340
4558
6908
468
5997
442
5511
3775
5603
578
4372
1991
3032
197
317
5623
5005
5288
6482
1247
431
5660
6663
7032
4648
1061
3130
1327
1292
1299
4021
7326
5466
1388
7344
4377
7292
7206
5168
2076
2318
3598
520
2283
3613
3615
344
1168
1623
1252
3665
5396
5882
245
2399
4163
2099
7330
6968
6167
7125
5617
3860
345
2211
3949
3198
4636
6972
5741
6639
1267
7219
6729
5243
530
5486
4223
886
2708
1757
6588
5239
3691
2935
6615
4403
1590
3270
4547
6362
1693
2699
6940
1939
3456
4921
3299
3873
5381
1622
6549
3090
2683
4130
1960
3120
5298
5385
4205
5436
6047
6543
6004
83
3107
4183
518
3469
948
443
3515
6631
2397
3226
639
7507
5335
5495
7458
4876
141
4354
3608
869
4679
3015
5604
3762
7445
469
100
7395
6551
2023
1205
2491
3771
1232
1154
5573
7371
1891
3994
1946
347
930
4003
5883
7078
2873
5395
567
1987
6986
2741
657
2776
2642
1846
1819
1274
4305
415
355
6875
677
3606
4842
1148
1250
3782
1616
5367
2434
272
4643
7029
7157
7180
5422
1793
957
540
2495
5305
6674
1936
3418
7025
2484
4203
699
1670
3070
5606
3484
4544
5594
2181
5089
7121
441
203
6193
6192
2663
4894
4120
5480
5936
5678
6890
6066
6758
6587
1953
6888
3066
1715
7250
570
7254
4413
6390
1129
729
7117
1006
6063
3148
3577
6649
2847
5822
7393
7533
7033
4641
4118
3021
6149
7059
5194
3088
1370
5658
2502
515
4587
2745
1397
3442
5935
4214
1814
5482
3155
6671
719
5731
3783
2060
3811
745
6393
3436
1121
3040
4378
2145
6959
4691
781
2919
2727
1972
932
78
2795
3062
7546
6046
130
1746
3466
6221
5647
583
763
4491
7329
5821
6905
6917
5109
3151
6417
7311
3213
5278
6625
2124
4270
1518
7419
2594
1361
5493
142
2012
5649
5484
2766
2512
5169
3172
6243
4486
6881
6444
5472
3159
2221
5229
1110
216
993
3744
3479
445
1750
1698
3703
3055
3104
2411
1743
1386
2655
1782
7137
7038
2080
1078
5705
638
382
2196
117
4628
5426
3400
3720
6704
5610
1500
5535
405
292
5203
5574
4199
1569
1302
5631
2936
3039
5555
5322
5402
2130
2028
6981
2035
4122
3354
2610
1744
3112
7110
6898
612
3168
5202
2646
7447
6079
2164
3943
6296
710
2576
5695
700
2730
3482
1865
4065
2524
2024
2393
7045
252
1963
6356
6542
1907
3506
3257
1941
5950
4683
686
##158
6447
796
180
3215
5525
5134
##482
2091
7075
6748
1618
4778
4941
4993
1081
747
4829
811
398
4482
6788
2421
239
7544
3813
3126
6325
5663
4626
768
3651
1294
165
3766
5600
6127
1915
4987
1206
1956
4832
5121
5648
3189
6862
2511
3312
2910
5986
739
5870
6236
903
6078
4693
6682
2429
7129
1390
7192
320
2768
6037
##111
5964
1425
5333
3080
4784
5380
2415
5872
84
4289
503
3030
5277
4861
2267
832
1545
998
637
2279
1389
5739
6111
1100
6298
6894
5295
6389
5728
4590
5502
5085
4005
6992
1829
1732
7387
642
1566
5536
4974
328
5064
2423
7378
1995
5160
2354
5289
722
2749
5056
4225
1459
4218
7122
2437
1853
6965
5683
851
7451
1833
6864
513
157
5190
5474
1515
566
2931
473
7360
3955
4848
6493
2120
505
654
5850
5644
889
5847
1014
4851
2626
3103
7144
5770
3650
1516
5374
4017
848
3438
4123
4976
7152
4030
2198
2480
3318
2879
3705
5416
1270
6658
5513
3793
7541
5369
634
6994
7106
182
5799
2329
2842
6324
2274
5716
339
7548
6203
4505
1160
6571
##08
2022
1508
5234
3324
2370
6139
1242
3836
1151
5613
3285
198
6414
225
3512
5504
938
2771
4686
5153
1777
7527
##718
3681
5469
4260
2046
6346
6600
3073
2346
4592
4245
##474
3724
2525
456
3182
266
7295
263
3268
1211
3878
384
1839
1542
1721
3049
4106
3966
5217
2483
208
6398
1775
3711
3343
2049
6265
2234
5076
4781
420
3563
6375
5208
5899
7394
879
1620
7477
856
1965
2866
2841
5968
4144
457
3170
760
2656
6683
4988
2030
3209
986
6164
1640
7028
2047
4699
417
2248
1166
2603
6906
4448
7051
1885
5184
4324
4375
5399
3053
5488
7317
399
6441
3248
4917
5777
6360
217
1835
3533
1158
4878
4874
1883
1057
482
7213
4906
6119
2214
2127
6175
4836
6445
7383
5026
1291
2976
676
1402
4002
5651
2275
4150
3503
3818
2519
3407
1087
646
4429
3319
5694
908
2473
2785
4022
5254
4597
3004
3749
1176
5621
649
7475
4108
2564
1304
5361
2070
##359
5804
1758
4334
459
4927
2998
6283
7362
4743
2474
4188
1832
489
7148
3472
5144
2068
4971
6327
119
4257
3309
1588
270
5793
5459
5281
5411
4061
6133
2379
3627
3978
3238
2667
2273
394
4718
6511
2908
7513
6311
2647
2327
4758
2702
1480
4335
6889
1855
3362
3414
4662
788
554
2369
3784
4337
##04
5257
4018
6011
1022
2487
7008
4700
3988
6956
2728
4278
426
5514
7088
3111
5242
6158
6272
3430
4928
3444
4274
4801
##431
853
2556
1265
717
1174
7479
3689
5917
2563
6575
7000
4436
6267
7062
5033
227
2762
802
3620
5297
4475
3583
2620
2867
6141
539
4680
1060
6996
247
4386
5347
777
4097
4794
1360
2942
2638
128
791
3359
3576
2709
7069
4567
5624
3718
5542
5477
2862
6574
403
6490
6287
2732
1111
3717
5004
4176
4934
1452
6396
5811
5316
1977
7111
5468
5348
2648
6161
5052
6817
7238
367
4152
778
6252
2439
7164
5785
5918
6640
4831
496
4249
3740
2233
7417
1325
5886
4841
2420
5922
4657
1603
1657
758
4478
4871
1289
4719
3360
6402
3489
2406
7175
3110
5834
2272
1343
4750
895
5247
2820
5931
945
1320
2979
135
7520
3842
1514
1827
5591
1818
3212
5501
5125
1076
1268
4536
6474
4968
3158
6454
1656
194
6825
2458
3349
1428
2586
5684
5034
149
5269
2639
485
718
6680
2453
2988
1737
5391
4070
7234
5638
1471
3742
4709
238
6234
5406
1638
2686
6802
5368
6318
1122
6337
5641
4119
1696
3351
4153
7462
342
6818
2428
2756
1858
3173
1220
2818
7224
4732
6738
2680
1764
5306
4366
536
1350
6895
244
1565
6976
3899
2582
6427
1964
333
6054
5017
444
118
226
6681
1564
2558
5308
4775
2772
1352
1008
2188
951
6780
581
2479
4431
3420
4402
5746
6754
2019
1981
2425
4083
2644
7375
6512
697
5581
267
2382
4052
1917
4276
3181
5136
4908
3921
136
4007
5753
6946
6819
1112
4280
6610
5047
3545
4835
711
2185
5823
1504
4285
511
5189
4728
2330
3059
4970
2682
4675
6431
2290
1973
6380
5709
3851
4191
4374
1474
3125
7510
3982
3344
4157
6144
6000
4930
1287
5438
3005
5383
4960
3745
1587
6087
6211
1107
6391
2169
3886
3036
978
816
7016
5928
3336
7109
2914
2179
4515
1783
2987
4479
1760
1096
2247
5773
3425
1986
4232
2567
5087
2431
4707
3095
5592
523
1184
3781
3727
455
2350
4736
6916
562
280
7210
1396
5656
3580
289
5824
1604
6947
5686
1090
5776
6423
2999
3267
1550
167
4560
1314
4077
2740
3161
1391
4466
5961
3821
4717
2055
6897
4439
5972
3290
4460
2591
5213
3845
4929
7207
176
6922
3657
5000
7043
7196
7241
6471
2363
1419
5815
2526
6928
7454
4690
4275
4951
843
1536
2673
3152
3517
2514
5206
327
3679
3338
4267
1842
3626
5884
7017
6355
6171
618
3093
2540
3150
452
3544
4922
5691
2017
5572
3147
5420
2508
4313
3002
5532
5371
1050
4082
3934
1243
926
3795
2831
4762
1073
1127
5862
4989
1497
785
7156
4782
7097
235
2005
6800
6635
7540
2863
1266
5979
6781
2011
2893
4627
5423
970
2566
230
7265
6892
1606
5929
630
7335
4357
5344
2438
6565
1950
2190
1678
7525
2724
5868
1195
6016
5960
5475
1424
3923
5969
2266
2366
1373
5127
6387
1690
2202
4729
6855
5769
1888
6295
4582
728
6134
3326
6842
4796
732
2572
3435
6507
7496
6720
1719
4265
7512
2530
752
4461
152
1435
7452
1295
6057
1142
1540
5233
4006
5954
6256
1002
269
981
5214
3266
3167
4767
4912
2804
5200
4695
4194
5618
6504
5182
5937
5907
2209
4745
5118
3643
3455
4169
3253
6430
4034
4614
881
6108
743
748
4310
6487
6500
159
4090
795
5720
5529
4493
7222
7483
3778
6036
1791
5360
3327
1755
3207
1718
2293
592
338
4761
4512
195
5215
1892
3079
2857
1013
6436
3914
1510
418
3992
3554
1902
6694
4442
1047
2995
1092
1780
3020
3232
2144
1453
713
5900
7426
6750
735
4748
6730
3614
3403
5552
6799
311
1431
7339
4814
5050
7391
6055
3200
3905
1631
1440
6608
3603
4255
6472
7245
2876
6562
1741
1940
178
4356
5940
7183
6838
817
3868
4757
6621
3729
5956
6829
3177
4985
326
5273
7353
7169
878
7380
7150
5869
5571
4873
1619
859
4506
4476
4380
2103
3951
6197
6971
1200
2761
6510
7493
5518
2351
4444
1124
950
2136
2734
5212
5715
1556
2852
4066
253
##156
6796
1905
2691
5020
6764
3113
5467
757
3952
234
3528
3850
3494
240
1260
7098
1671
1023
7208
3983
1065
7225
1745
6582
7197
2260
214
4405
789
4500
7529
5274
3385
1042
6513
364
5792
2710
1916
6702
156
4991
413
1651
3910
1071
2341
89
6303
3662
4504
3647
6815
1502
6189
3649
1164
3716
2178
1086
##716
2714
6032
1297
4323
2924
7404
6870
5690
7300
6347
4358
4940
2240
4887
4004
555
5156
6690
1423
1868
3280
3977
962
3262
2138
4742
3946
4862
2345
6517
2468
3925
4055
4408
5003
6830
2139
5636
5673
7226
7001
6804
332
5714
1221
2713
354
4611
4766
741
3141
1251
4382
1191
4556
3345
988
2581
6914
1273
7453
5340
3856
359
7015
254
3371
2832
6675
2140
1769
6056
2394
4575
1332
5258
4914
5632
2631
2236
1838
5442
2231
6254
5255
3918
7299
7272
5398
5595
839
4031
3617
6467
3054
5635
2056
4262
4514
4651
7131
4234
3610
2172
5548
2739
3313
780
3411
2156
1639
727
6198
7410
3052
3273
6364
6784
4777
1326
6757
3855
7034
891
6989
6570
2653
7501
1416
4896
3225
148
964
5315
1140
830
6404
733
377
1609
3897
4973
7170
3096
4509
6812
5668
5317
5894
6335
4731
397
4715
5082
5177
6199
6059
2945
1928
529
2422
4961
1105
1691
4623
2925
5974
5723
6893
3848
6135
4555
6067
2562
7464
3447
7116
6377
7096
4720
5092
6386
805
476
5325
3941
5895
1547
1163
1278
1364
2307
1826
1822
1449
4624
1645
956
2044
425
5379
2054
692
5865
5861
1627
1055
2359
3416
2561
3631
2958
5512
187
6151
4864
6244
6941
3146
5970
373
3622
7505
3451
115
724
3758
3121
3998
1306
4012
3011
2069
6338
3917
4903
1072
4615
3233
2401
1538
3807
5829
2064
4440
285
6277
1486
5752
2964
5228
7086
2875
4949
959
5614
336
7190
2000
3294
4716
7282
5205
1579
4353
4548
7442
4497
2571
3825
5697
854
1648
7424
5129
2356
533
3306
4660
5094
574
3969
1848
823
2874
1984
372
4565
3022
7168
6845
975
3320
1347
##162
7333
5873
6949
6379
3732
2598
3999
2457
162
7534
2972
5429
3866
4771
3746
1068
939
6473
7350
301
946
3406
6633
2523
3721
6591
2472
4549
6094
907
2950
3304
6062
6636
7310
6878
2189
2629
5813
4410
1235
4652
76
7031
6450
7289
1598
4889
1102
6424
6126
6749
2237
5892
1694
6307
7491
6329
4911
6718
6257
3565
3057
2098
6769
1831
5392
3459
1171
5941
6142
6266
5418
1958
3929
933
5876
3521
3728
621
2902
3664
6932
2288
5433
4956
6262
6753
5059
4658
395
1341
6807
3676
3194
1614
2547
7185
3254
1733
6083
6937
5133
2391
1234
4843
3108
3869
6292
2778
2917
7012
297
3986
257
3265
7515
2604
5607
3127
6085
3567
5578
3536
4799
2358
682
5456
7368
674
4172
1676
6790
460
2798
4950
679
5540
3668
6611
1044
2228
2513
6660
2721
3483
1563
804
4557
5634
949
3271
5840
3829
2299
3894
3973
5903
5010
1870
6771
960
707
2809
5874
1411
2141
6809
1959
1509
6762
1529
2132
207
1248
564
3562
2447
3653
3346
1787
313
6848
1089
3083
5071
7440
1451
4096
1931
1849
4093
5417
579
5074
7214
6497
7361
5762
6435
5963
1544
261
4872
1406
4574
7381
3683
6840
2310
7411
3144
4852
1938
3595
2102
5287
1727
1728
3328
6174
2901
1000
2636
4258
5596
762
1208
1417
5580
6852
4451
2027
3990
7423
6850
181
5137
1710
3109
2170
852
1033
302
370
6684
4924
1901
5887
2705
7306
1716
806
6557
1669
7162
3340
6128
770
429
1489
2381
6233
3445
7422
3258
7188
850
5107
3670
2765
3871
7223
3907
2284
6847
5115
3131
6697
4578
1307
7469
653
3572
1792
4299
615
6020
4048
6545
1199
2337
2938
7531
5719
1339
2253
5362
1366
5123
5674
2929
6868
1309
2814
3518
175
447
3628
4517
324
6924
4273
4996
6522
5471
7181
5921
1811
7216
5901
6785
4295
7046
1441
6491
4606
688
1180
901
5013
6506
6113
2419
3975
958
3723
2510
4763
3311
2374
753
5856
3779
6882
1179
2239
5210
7318
604
3812
7523
1650
2249
3965
7202
1674
5093
147
2123
3714
1890
6988
6921
5293
4712
4722
6348
2679
3216
6214
125
3277
2930
2531
5405
1878
1045
1182
5382
2781
4300
6116
586
6563
1595
797
1966
2067
5018
1173
3558
3160
896
1384
2232
1298
7446
1157
1466
5106
3023
6900
1275
323
5733
3415
81
2892
6328
4168
5751
6237
4776
2285
2706
6156
3655
6181
7494
4999
5932
2220
4416
5114
174
835
4078
875
551
1608
2956
5008
1682
5256
5149
1532
927
2478
4390
2652
2939
2985
4870
5533
6866
5404
3047
1212
684
7277
6185
3889
1874
3900
2038
2640
2250
98
5951
7294
3903
283
4640
2812
2485
4164
3391
3334
6091
3427
1010
5001
1433
1082
6733
4992
1482
651
1643
2291
1093
3139
6191
6661
3487
2787
7093
3960
1038
6279
4788
6023
3754
2504
2669
2689
5337
1812
5478
4702
483
2565
887
4676
1661
3814
2166
912
2905
4175
1751
5687
1525
5431
386
4522
3833
204
2937
6231
5601
4155
6782
1685
2278
6229
2911
4916
633
6843
1172
2194
5452
6313
2692
5546
4824
2947
3499
7312
6460
1128
479
5311
6238
4817
378
4696
3698
509
1272
6455
1900
2944
5754
7405
448
5549
5797
7061
2953
6958
3667
6594
709
5978
5097
3426
7285
1358
2703
2224
1546
5952
4437
1823
2045
1948
1978
7519
3443
3526
2268
7535
5848
2006
6618
3940
3542
7301
1004
3046
5779
5241
1753
5171
4014
7179
4730
3462
5476
4059
5738
3734
4584
6580
1921
5261
3854
1067
3153
5088
5487
952
5650
164
3570
6857
3006
4419
6140
6369
6316
5461
106
1599
5796
2113
4821
1594
3756
1458
1496
5517
2321
4015
5622
5186
7094
4759
5556
171
1041
2167
2965
1481
5352
4854
1961
3325
2752
5527
2796
7084
5147
7332
3449
2634
7498
107
7459
3592
7345
143
7514
4239
4790
2665
1809
6099
5494
6147
1414
1700
4774
6334
4304
3808
2297
4250
3947
3557
4494
1478
5902
7050
7074
5758
4789
7542
943
7342
3297
3348
5152
2395
681
3063
1084
7499
2105
6896
3003
2339
4812
647
421
5174
1398
3275
1108
2616
5575
1196
2389
3383
2032
1522
7215
2117
5637
2008
4263
7275
643
1923
5819
466
731
2057
504
2182
##642
5120
7288
3251
5947
3428
4572
5039
6153
1909
4642
553
5885
4619
2390
3044
7149
95
7060
6805
295
5019
5608
4982
5545
3805
3408
3571
7336
2834
5207
6406
3474
2496
2529
774
2254
3596
5544
844
1856
1296
5032
605
5993
963
5079
3485
1864
6294
502
4880
1028
2432
7478
4667
1367
7545
1840
4954
2641
3984
1378
6370
620
3157
6385
6679
385
2227
6939
5286
6275
6787
4837
5703
4420
2615
5628
1165
838
6481
3081
5506
3797
4856
4110
2455
4279
7100
6304
3722
1383
6084
4423
6533
5191
2963
2033
2527
2864
3368
4793
7163
3392
5270
3376
286
158
5443
82
2946
1413
5113
3822
5783
1555
7412
4397
558
7313
6408
4198
5197
2596
5040
841
5366
7537
6372
6219
7448
2632
6659
1615
4739
2163
7120
6400
5223
2559
6107
708
7243
2966
5657
2583
6264
4705
3308
2940
6462
1256
2223
6998
1485
3776
6031
3882
1662
4133
3535
6100
4897
4975
7461
3249
3190
3696
1186
1880
5835
3785
4879
4428
4342
1056
3234
4035
2811
1461
831
5183
2780
2623
6463
2036
1861
6259
2168
5054
5995
1720
7118
4875
1126
1353
3767
1993
2550
3967
2915
4297
5851
1749
4178
5563
2336
2535
2507
6475
6002
5939
1976
2039
2149
3733
5781
4749
5263
1225
755
3763
3957
1794
1442
1630
7067
2951
5387
2897
2440
1725
779
3087
104
3058
185
5696
4957
6026
6696
7303
6064
2637
4131
1664
4051
6786
4963
4221
3496
1908
4088
7365
5111
4596
1083
1467
6483
424
6345
4545
2855
2079
168
5128
4978
4844
5625
2996
7177
453
4521
6874
4094
2659
783
4638
5567
407
1573
79
2470
2800
2922
4907
1175
7103
3184
557
4580
4081
7171
6828
3625
590
5825
3217
3931
6539
782
1543
525
6918
7101
602
5962
3534
6960
4826
1517
1828
944
2065
3959
6821
7500
7227
191
7286
863
1873
2912
7036
2043
3179
3769
1752
6974
6667
545
4885
691
7142
4395
7364
2894
1761
7176
6013
6546
3419
4834
2347
6365
215
6712
5131
3753
3315
5732
7414
4995
99
4171
7409
4266
7203
4966
461
918
5890
1763
2973
2613
5162
714
169
7191
4534
3219
4944
5942
6150
1882
3115
416
1188
2599
5990
6358
2081
5669
4363
3710
2568
6616
232
3412
4327
6439
3286
916
6544
3936
4797
1432
4103
3393
2978
2606
4487
6162
3132
3708
1742
4895
1040
6531
5193
4215
6954
4809
2751
940
7066
3243
6418
4513
3804
4050
1409
2775
6239
123
3208
7530
5259
7236
2129
2575
1974
3379
6232
1032
2672
1686
4137
2503
5424
4529
2089
6556
6058
6392
6429
7184
5944
1007
3086
2460
5652
1005
6534
994
5246
2100
695
6727
6686
1410
3827
5349
7304
1475
1576
2146
6323
6486
1666
5415
3331
6622
6388
2789
2320
7266
6001
2718
2162
2025
4689
3061
3933
2707
1570
5855
2830
5376
4492
2187
7187
3025
4639
6039
2332
7115
501
5067
1189
5407
2449
1336
1559
2241
3048
4008
6188
2955
5457
2155
6614
3911
4663
4467
1030
5421
5898
2607
1713
3246
1426
3045
5048
124
2880
5444
5806
6103
7473
196
582
6326
2219
4610
1492
2992
2546
5262
4581
2257
3034
5561
5195
4935
1236
4079
799
3735
4850
3974
6646
6632
3375
5761
4918
7470
6527
5981
4314
1652
3693
5727
6249
3806
1201
7341
5341
1801
6415
6155
967
4882
2096
6129
864
5388
3078
7124
6033
6883
5154
3541
3611
6499
3492
1436
1910
288
6584
4538
2003
6595
3178
3801
4177
5818
6359
5151
6090
6834
2404
3922
3218
6502
6130
7228
471
6019
4206
209
6166
1400
1246
5237
6110
5713
3457
7334
1575
3323
5692
2152
4827
4752
5772
793
1672
4424
2063
7248
6112
4288
4530
5022
5086
1281
7014
1935
5353
1285
888
3538
3413
3071
2110
4681
4189
4507
5409
7356
2413
7235
2160
2195
7441
2183
2426
6190
898
1796
5653
2664
2492
6096
7369
3857
3876
3604
4000
5959
6904
1625
837
1768
6461
3847
4062
3192
6420
6255
678
6744
2486
1162
3826
6204
4919
5201
6154
7389
1887
6664
4528
1149
2980
5807
93
2793
5857
6035
4254
3522
6528
6041
1328
5812
4060
3788
5933
5774
5679
6218
4433
3369
1456
5667
1847
202
5680
1954
6200
3468
1178
3010
7536
3537
6564
1046
2026
5249
6950
4383
3042
3561
5605
5808
704
3669
5304
6488
5924
2200
2078
6225
2352
2712
4649
4243
4942
7406
2927
1527
3964
4449
6955
4376
4926
6858
1860
7517
2957
3581
6477
1357
4165
2398
5685
6049
1943
1843
4477
1305
6247
4185
1254
4654
5102
4694
5155
2701
3602
3228
3075
4635
3624
1377
2774
4607
3794
3347
6912
2657
2758
4364
7141
4984
6434
1382
4074
6576
996
3041
5276
7258
7274
3493
941
6022
1677
6820
1387
2731
4604
1925
1533
2670
6708
2225
821
2819
2806
613
858
5551
6240
7200
3388
4368
3136
6957
7182
1557
6877
1365
7252
6726
3707
5163
4962
917
924
1632
1313
2794
5108
7049
4625
4937
3507
3065
7048
3547
1404
2114
2587
1988
976
3924
3954
4979
2943
6121
7189
4898
2878
6195
6526
3549
5717
4348
4343
2933
6931
1654
2309
5541
389
2243
6102
4311
7151
987
5905
588
6371
7114
911
7398
534
1097
1499
4618
4341
4983
4229
1190
201
4041
3566
3573
2031
4539
1537
1037
2649
6561
1658
1810
5666
921
4585
1230
4016
6529
1109
4159
170
6746
845
1493
7229
3736
1125
3591
953
4422
3551
7508
6867
1088
2048
5272
4997
3454
765
1637
5836
6624
6739
6401
335
3791
1642
5927
1572
3016
1872
1802
721
7244
5584
5080
1216
706
7064
4025
3239
4901
6428
6184
1894
2754
7135
4723
1634
4550
5615
6741
4953
5481
961
1059
7516
357
7230
5805
1601
3838
5266
3240
4033
7432
6331
2521
4533
5896
6194
4196
3188
3757
1817
3556
4904
2126
2443
2083
4783
5609
1177
4158
4174
1159
607
5967
3237
1130
3423
1636
2409
1857
1346
1740
4401
890
862
2408
5384
1837
1867
1851
6263
4242
4142
2601
4714
5994
4756
1003
6880
305
1213
3550
4312
5225
4865
4884
2537
6520
5671
6117
3124
3867
627
1290
3680
6366
6458
5664
2697
7138
870
4569
1209
5646
7081
5425
1712
3660
6105
4365
4038
664
242
5342
5016
5062
4186
1218
4098
321
1789
3140
3409
3666
6440
4385
3417
2534
3958
4026
5786
6525
4001
3206
5586
6217
4134
2840
2335
5219
5706
2261
5735
4349
4347
4785
3588
3453
3332
3116
3597
973
1611
4857
6074
1535
2849
2733
231
7158
1541
3875
587
5722
1762
1506
6736
1422
4932
4092
5725
675
2635
6177
6341
7140
6601
6604
1421
3357
6397
3013
1012
7237
7139
6590
6936
7416
1646
6261
6208
2737
4737
6538
4344
7502
4682
6124
4481
2134
798
6871
189
2898
7056
3260
5755
3633
2377
6961
1933
3394
1490
6677
3759
3908
1257
7022
3511
6773
1445
2609
6806
1863
2952
866
2590
2755
2088
3579
4740
6514
2627
1443
696
6028
1342
3381
6952
6503
5500
3935
5303
3991
4485
190
1053
2821
4049
3527
4362
3204
2675
822
1593
3072
4200
2111
4990
3105
5503
1596
3843
3321
5483
3175
6309
2822
5820
294
5198
5507
5672
7005
2493
2735
2797
3450
685
188
4473
4011
6791
6910
5485
1628
6097
251
2014
4069
6628
4633
5795
3682
4361
7119
3008
3677
5943
6246
5042
7089
6665
6765
4394
6607
4501
2690
3138
6071
1711
2482
6685
6993
3673
5965
3895
6278
4240
3944
7080
2319
7260
4678
6775
2720
3390
2412
7347
3037
1898
4938
4746
1161
6984
6409
4338
4713
1707
3786
4899
4846
1578
390
5642
7068
5279
3363
1770
2150
5175
3690
5354
1450
5676
1192
3645
6647
6480
6849
3828
5058
5053
5434
3211
3100
5142
7146
2605
131
2815
2053
474
4328
5170
6120
2174
2805
999
6030
2557
2259
1074
7472
1039
4389
5661
6496
1185
2890
2015
3509
1498
2333
4674
4591
6839
5312
5432
6793
6987
6411
4306
3183
5138
1434
5534
1617
6844
5350
4438
5453
2773
206
3553
3229
1487
771
833
968
3802
4474
5867
2322
2368
5250
4084
3559
2469
2302
1714
3480
815
909
256
1893
1399
3927
1075
2869
7526
4072
2900
2464
4726
1034
3834
6999
6865
2311
521
4071
6505
4359
7220
3993
929
2418
1549
6209
5049
3398
3135
4360
2608
7488
4613
113
5729
3741
6024
1975
6813
1337
1319
3919
2816
4920
2928
436
6437
1123
5309
3287
3865
2856
563
5831
5238
4058
4009
4204
6395
2441
4588
1558
1881
5024
1330
120
2868
2886
2759
3314
6717
4798
5280
5372
6479
813
2405
4830
1912
7315
1852
6212
6207
3519
1703
6761
2611
6300
6363
6226
6470
3930
4445
4608
2618
972
5579
2497
484
6082
5465
4085
4644
6789
3601
5734
6605
6705
4384
7205
6373
2668
4489
480
255
2542
3890
2262
5323
1203
2344
3575
7270
1754
2961
6653
1776
3205
3486
97
3840
4136
5451
754
7511
4027
6648
1781
4773
5355
3441
773
5524
594
6827
3060
108
2850
2750
5265
4045
329
7291
5794
6752
6756
6970
7437
2643
5173
4107
6443
4634
3156
1001
786
840
4888
2817
2823
2746
6703
3145
6944
5490
3684
6933
2175
2424
6068
6081
7337
7323
1528
3024
1834
6269
3970
102
7054
6755
6963
1505
6676
5187
3122
608
6048
3091
4247
4426
5645
7024
205
2092
2326
6540
5496
434
3448
1118
1472
4179
846
966
243
1937
3082
2871
5412
5832
5879
2051
4047
3525
7217
3341
6568
3688
7302
5143
2118
2654
7007
1491
5528
5577
4828
4825
3372
5313
1293
4415
7092
5817
353
3291
2954
1147
3439
2481
7143
7463
2907
5987
2962
5707
2676
77
376
3748
3730
4815
1979
1597
3926
1237
2843
2895
4765
4905
1996
4632
7201
4414
2305
2186
776
905
934
3799
2436
6824
5364
1368
4253
2861
5845
2016
2340
2361
4600
4121
2916
6577
4102
1222
4387
5675
6532
1131
7132
925
5539
4855
609
2569
2536
626
6260
6213
3968
4452
2711
4943
2372
475
7307
4101
6315
7133
5038
6138
3751
559
601
6803
5314
5065
282
2836
5643
3637
291
5148
6339
4309
1113
3452
7476
6336
2158
860
914
4839
4869
1922
451
1520
4248
4210
3962
1240
3316
3386
6797
3142
6524
114
2982
2462
3470
3195
4727
4336
6383
2303
4668
855
6010
1962
4552
1591
3803
5386
1845
3963
2882
5670
5893
2018
7297
5784
1765
6766
6763
4964
2137
694
3410
5164
6344
6368
7130
6634
4115
6776
1808
1804
4443
2159
3353
6465
716
800
882
928
5553
1689
1944
4593
4573
1321
4146
121
1261
6698
7242
5740
4915
2624
4320
1507
1772
6114
3187
4687
2034
1183
1484
4602
6476
6131
1709
834
985
5569
161
4800
6086
1957
1581
3817
3820
1895
6251
6276
1249
1204
4453
2826
7063
7522
5299
402
3539
3244
575
5742
4318
1408
3303
5378
6935
5002
7413
1488
375
2476
4860
4537
6826
5329
625
6270
1312
4425
4091
3546
7273
7218
4948
6953
7372
5199
5934
2001
2009
6498
1444
4684
7107
5390
3985
784
90
3760
2452
488
4849
4804
6044
5919
5904
6836
6808
3839
3879
5343
1875
1069
7087
236
3543
4735
4733
1133
4195
6901
1501
6456
7402
3656
989
1683
2417
2577
5946
4551
4579
6872
2206
5319
308
5030
2050
6516
6343
2645
2909
1427
7172
3671
3642
4666
6923
769
801
96
6489
552
6095
2573
2552
2553
5973
388
6230
4292
4457
4421
2837
5248
3230
6975
2981
3584
3638
4502
5103
5771
3995
3118
374
6034
6891
3877
5327
3050
1824
5075
1310
1393
3906
7041
5294
4064
6691
7262
1797
1788
2177
4747
4754
6572
5172
7376
6310
3587
1930
6555
1430
2725
1282
7287
371
241
2520
5318
3029
4235
4264
1020
7030
7549
7538
5849
2085
2386
4706
4319
4980
6179
2904
2651
6422
2281
5035
1354
1904
6873
3849
6299
392
2037
1748
6742
4791
7503
2625
5359
4303
4772
6492
1187
7407
7351
86
92
935
3726
2403
2459
6042
7322
1560
6876
6801
3858
2292
1830
1862
6201
5073
5021
1349
4170
4182
5626
5458
2760
2753
5230
5267
4629
5700
5759
3339
4972
2960
4398
6687
5358
6586
6554
6774
5031
3288
7174
3678
1359
5557
1687
2451
4532
5365
5346
3014
4138
1098
2813
2885
7040
5852
2084
2360
5275
4075
725
4913
2949
6942
1167
5112
6317
7165
5414
5196
1446
1439
1420
3174
3475
7104
6495
4039
2678
4283
616
6642
4823
4886
6098
259
7325
4563
4527
153
6879
2258
2264
2245
2276
3077
6268
5045
1318
4212
4251
3953
1202
705
2040
2387
4099
7278
576
5757
6743
362
6593
6351
1150
1135
5682
7429
3467
1723
1503
6523
2932
1224
5222
6553
5463
7002
1983
6468
1438
4616
4154
766
7397
7482
969
160
1649
2430
4803
2518
595
4511
1552
6851
3861
3863
3874
3069
6273
5077
129
1021
5437
7518
2742
589
5866
5878
4044
4054
3264
7249
3389
3387
3382
6711
3639
3629
4900
4947
2199
6354
2467
5180
4331
3432
5356
4222
1114
5701
7390
3672
3702
3701
1644
2433
1967
7319
4518
1530
1568
6859
3892
2246
2263
629
4252
4162
5665
5611
5629
7072
7020
5830
5268
5245
3555
3293
7211
5711
3350
3222
3640
4965
2142
2948
1464
1372
7415
2989
3498
6907
3123
2338
2280
3302
1429
2921
7004
3989
6425
2671
7358
7418
4601
787
865
819
842
3789
5599
5516
5587
4818
4838
2516
2589
1945
1926
5976
7382
2215
306
3089
3085
1820
506
4140
1269
1238
1052
2860
2844
2881
7085
274
2700
2767
5236
4019
4087
4056
3520
6623
7268
7253
5756
3199
3600
3612
4945
6550
6548
6558
3402
6353
4656
6109
2600
4346
4339
6145
6657
7193
6222
2128
4332
3434
7401
4388
6442
4286
7204
2694
4488
1138
2122
792
807
931
3738
2442
4813
2532
2579
2588
1911
7367
4540
1574
1584
6823
224
2216
1886
6215
1369
3979
1095
2854
2888
7521
2744
5846
5888
5875
2314
524
5253
5232
4076
3593
3564
3250
6619
7269
5782
6700
6767
4977
2180
6599
6948
6969
1119
3074
4701
6170
6652
6349
7145
3663
3632
4994
6410
6592
1229
5224
5809
1403
1009
3675
1495
7481
2617
6186
825
3798
3773
3704
4810
4890
4883
4807
6061
2548
7348
7343
4577
4524
689
6853
6814
3810
3891
3885
2251
1836
5015
1329
4244
4100
4161
1244
1094
7076
5859
5853
2324
2325
2388
5240
5244
4043
4024
2997
7246
1798
1773
1795
5991
5447
2165
2143
2375
6547
4495
7308
4192
4393
6146
6716
5146
6399
6330
6367
3191
4724
2002
6446
6449
4370
6672
3490
5373
6413
3171
1418
5394
2357
7280
7487
7352
6927
1155
6645
1659
5132
7431
828
997
904
3774
5559
1600
4868
4863
4881
1968
1955
5911
7321
4571
1561
1577
1554
1521
683
3853
2238
5320
1800
1896
6241
508
5012
5068
5023
1322
109
4435
4470
284
2872
2101
5419
5454
5844
2343
2385
4073
356
3514
3279
2994
7267
7233
7259
5749
179
1766
3180
3621
4710
6519
6967
6979
6978
1169
6196
1392
7450
7435
3685
2628
4345
6148
5161
2488
7166
4404
3463
3031
3035
1035
4673
6451
1990
6412
5357
4224
1115
3658
6721
4631
1455
4156
6990
3201
4734
1982
3996
2171
2176
6494
1197
7281
7284
1153
6159
1136
1226
1708
2301
5985
5301
814
991
984
3752
6484
5565
5564
163
1665
1692
1624
4840
4806
6077
6053
6076
2574
1942
5958
5916
5953
4535
4554
1548
680
6860
381
3880
3881
3884
229
2242
6210
5069
5078
1300
4271
391
3904
1253
1064
1024
4456
4427
2833
2887
2108
5699
5630
5633
5400
5427
7524
585
5800
5863
5891
2077
2062
2323
4028
4086
351
3599
3552
6699
7298
7290
4621
5710
5768
5763
5764
5745
3365
3337
3367
3380
1799
1786
5992
5996
6719
6794
3619
4959
4711
4770
4769
4787
2969
2971
1376
7379
3609
2650
6137
6180
3437
3471
5110
5140
5135
5167
636
6312
3001
3033
6006
2116
6709
2906
5654
6589
6585
3491
3497
4111
5104
2204
1104
1473
5462
7195
1303
6381
6421
6426
1989
6464
2801
7484
7355
6332
1194
1301
1134
2677
3333
3301
4226
516
6778
6152
6132
772
775
87
867
880
829
836
808
937
942
947
995
379
3768
3761
3777
5568
5523
1673
1663
2414
6080
6051
6021
2544
2517
2585
1969
1971
1918
597
3378
7320
7316
7331
7388
4546
4570
4564
4523
1539
1589
1523
687
6816
3830
3841
221
2298
2277
2213
2294
5324
5321
3098
3092
186
1876
624
6253
5060
5029
5083
1340
1316
4246
4290
3950
3942
4112
4160
4141
4187
1259
1207
4465
2877
2824
2883
701
7070
7018
542
5446
759
278
2010
2093
2059
2013
2095
2074
2312
2317
2383
526
5260
5290
5252
409
4010
4020
3261
3245
6670
6626
6629
7293
7271
7247
7231
7279
7276
4665
4670
5748
5798
5730
5760
5766
5747
3399
4127
4129
1790
6747
3119
3164
3635
497
2135
4795
2977
6566
6911
6951
1143
7430
7439
7428
2630
3697
3505
4322
6169
5283
7427
6282
6280
3589
7466
7443
6732
4352
1771
3197
3102
5982
4379
2287
6597
4227
4113
4116
6416
6938
1447
4284
1437
5464
7209
3932
4685
5204
5307
5302
6394
6384
7474
1655
6378
6376
2704
7178
2802
2353
6926
4605
6438
4661
6136
